In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv('dataset/Dataset_15_Mart_POS.csv')
df.head(3)

   Member_number        Date itemDescription
0           1220  2015-01-01     canned beer
1           1220  2015-01-01       margarine
2           1220  2015-01-01       chocolate

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20488 entries, 0 to 20487
Data columns (total 3 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Member_number    20488 non-null  int64
 1   Date             20488 non-null  object
 2   itemDescription  20488 non-null  object
dtypes: int64(1), object(2)
memory usage: 480.3+ KB

In [4]:
df['Date']=pd.to_datetime(df['Date'])
df.dtypes

Member_number               int64
Date               datetime64[ns]
itemDescription            object
dtype: object

In [5]:
df.Date.dt.day_name()

0         Thursday
1         Thursday
2         Thursday
3         Thursday
4         Thursday
           ...
20483    Wednesday
20484    Wednesday
20485    Wednesday
20486    Wednesday
20487    Wednesday
Name: Date, Length: 20488, dtype: object

In [6]:
df.Date.dt.year

0        2015
1        2015
2        2015
3        2015
4        2015
         ...
20483    2015
20484    2015
20485    2015
20486    2015
20487    2015
Name: Date, Length: 20488, dtype: int32

In [7]:
df2 = pd.read_csv('dataset/Dataset_15_Mart_POS.csv')
df2.head(3)

   Member_number        Date itemDescription
0           1220  2015-01-01     canned beer
1           1220  2015-01-01       margarine
2           1220  2015-01-01       chocolate

In [8]:
df2.Date.str.slice(0,4)

0        2015
1        2015
2        2015
3        2015
4        2015
         ...
20483    2015
20484    2015
20485    2015
20486    2015
20487    2015
Name: Date, Length: 20488, dtype: object

In [9]:
df1=pd.Series([20250101, 20250102, 20250305, 20250328])

In [11]:
df1.dtype

dtype('int64')

In [12]:
df1=df1.astype('str')

In [13]:
df1.dtype

dtype('O')

In [14]:
df1.str.slice(5,7)

0    10
1    10
2    30
3    32
dtype: object

In [15]:
df4=pd.read_csv('dataset/Dataset_04.csv')

In [16]:
df4.head(3)

  LOCATION SUBJECT  TIME      Value
0      AUS    BEEF  1991  27.721815
1      AUS    BEEF  1992  26.199591
2      AUS    BEEF  1993  26.169094

In [18]:
df5=df4[df4.LOCATION.isin(['KOR','JPN'])]

In [19]:
df6=pd.pivot_table(df5, index='TIME', columns='LOCATION',
               values='Value')

In [20]:
df6.head(6)

LOCATION       JPN       KOR
TIME
1990      8.232901  2.887128
1991      8.146132  5.477802
1992      8.304596  6.725442
1993      8.338766  6.734564
1994      8.510980  6.969335
1995      8.695862  7.510509

In [21]:
from scipy.stats import ttest_rel

In [22]:
ttest_rel(df6['KOR'], df6['JPN'])

TtestResult(statistic=4.443244720437088, pvalue=8.116825815589112e-05, df=36)

In [23]:
g1=df4[df4.LOCATION == 'KOR']
g2=df4[df4.LOCATION == 'JPN']

In [26]:
g1_m=g1.groupby('TIME')['Value'].mean().reset_index()
g2_m=g2.groupby('TIME')['Value'].mean().reset_index()

In [27]:
g1_m

    TIME      Value
0   1990   2.887128
1   1991   5.477802
2   1992   6.725442
3   1993   6.734564
4   1994   6.969335
5   1995   7.510509
6   1996   7.982231
7   1997   8.000748
8   1998   7.502264
9   1999   8.845784
10  2000   8.739290
11  2001   8.834137
12  2002   9.290611
13  2003   9.867919
14  2004   8.792856
15  2005   9.154318
16  2006  10.477749
17  2007  10.922607
18  2008  10.985296
19  2009  10.834093
20  2010  11.603065
21  2011  11.699831
22  2012  11.532006
23  2013  12.374225
24  2014  13.318681
25  2015  13.813531
26  2016  13.916445
27  2017  13.971307
28  2018  14.036648
29  2019  14.098736
30  2020  14.160916
31  2021  14.225213
32  2022  14.298578
33  2023  14.372939
34  2024  14.445343
35  2025  14.520871
36  2026  14.598002

In [28]:
pd.merge(g1_m, g2_m, on='TIME').head(3)

   TIME   Value_x   Value_y
0  1990  2.887128  8.232901
1  1991  5.477802  8.146132
2  1992  6.725442  8.304596

In [29]:
from scipy.stats import f_oneway

In [ ]:
f_oneway(